# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [2]:
import numpy as np
import pandas as pd
#import requests

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [3]:
data = pd.read_csv('C:/Users/user/Documents/02 - FORMATION/Iron Hack - Data Analysis/Module 2/temp.csv')
temp = pd.DataFrame(data)

#url = 'https://raw.githubusercontent.com/PHP2560-Statistical-Programming-R/r-package-beautiful-day/master/data-raw/GlobalLandTemperaturesByState.csv'
#response = requests.get(url)
#temp = pd.DataFrame(response)

#### Print `temp`.

In [4]:
print(temp)

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [5]:
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [ ]:
"""
City & State : cat√©goriel
Temperature : discret ou continu ?
"""

#### Select the rows where state is New York.

In [6]:
temp[temp.State == 'New York']

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [7]:
temp[temp.State == 'New York']['Temperature'].mean()

10.74074074074074

#### Which states and cities have a temperature above 15 degrees Celsius?

In [8]:
temp[temp.Temperature > 15][['State','City']]
#temp[temp.Temperature > 15]['State']
#temp[temp.Temperature > 15]['State','City']
#temp.groupby('State', 'City')['Temperature']

         State      City
0     New York       NYC
3  Connecticut  Hartford
5   New Jersey    Treton
6   New Jersey    Newark

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [15]:
temp[temp.Temperature > 15]['City']

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [16]:
temp[(temp.Temperature > 15) & (temp.Temperature < 20)]['City']

0         NYC
3    Hartford
Name: City, dtype: object

#### Find the mean and standard deviation of the temperature of each state.

In [17]:
temp.groupby('State')['Temperature'].mean()

State
Connecticut    15.833333
New Jersey     21.111111
New York       10.740741
Name: Temperature, dtype: float64

In [18]:
temp.groupby('State')['Temperature'].std()

State
Connecticut    1.964186
New Jersey     1.571348
New York       8.133404
Name: Temperature, dtype: float64

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [2]:
import numpy as np
import pandas as pd

In [9]:
data = pd.read_csv('C:/Users/user/Documents/02 - FORMATION/Iron Hack - Data Analysis/Module 2/employees.csv')
employees = pd.DataFrame(data)
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### Explore the data types of the `employees` dataframe. Comment your results.

In [10]:
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [ ]:
#quali (ou assimil√©) = object => categorical
#quanti = int64

#### What's the average salary in this company?

In [12]:
employees['Salary'].mean()

48.888888888888886

#### What's the highest salary?

In [13]:
employees['Salary'].max()

70

#### What's the lowest salary?

In [15]:
employees['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [16]:
employees[employees.Salary <= employees['Salary'].min()]

    Name Department Education Gender    Title  Years  Salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find all the information about an employee called David.

In [17]:
employees[employees.Name == 'David']

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [18]:
employees[employees.Name == 'David']['Salary']

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [19]:
employees[employees.Title == 'associate']

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [20]:
# Method 1
employees.iloc[0:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [21]:
# Method 2
employees[:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [24]:
employees[(employees.Title == 'associate') & (employees.Salary < 55)]['Name']

Series([], Name: Name, dtype: object)

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [29]:
employees.groupby('Years')['Salary'].mean()

Years
1    35.000000
2    38.333333
3    55.000000
4    35.000000
7    60.000000
8    70.000000
Name: Salary, dtype: float64

####  What is the average salary per title?

In [28]:
employees.groupby('Title')['Salary'].mean()

Title
VP           70.000000
analyst      32.500000
associate    56.666667
Name: Salary, dtype: float64

####  Find the salary quartiles.

In [26]:
employees['Salary'].quantile(0.25)

35.0

In [27]:
employees['Salary'].quantile(0.75)

60.0

#### Is the mean salary different per gender?

In [30]:
employees.groupby('Gender')['Salary'].mean()

Gender
F    47.5
M    50.0
Name: Salary, dtype: float64

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [49]:
employees.groupby('Department')[['Years', 'Salary']].min()

            Years  Salary
Department
HR              2      30
IT              1      30
Sales           2      55

In [32]:
employees.groupby('Department')[['Years', 'Salary']].mean()

               Years  Salary
Department
HR          4.666667   45.00
IT          4.500000   48.75
Sales       2.500000   55.00

In [50]:
employees.groupby('Department')[['Years', 'Salary']].max()

            Years  Salary
Department
HR              8      70
IT              8      70
Sales           3      55

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [51]:
def diff_salary():
    for sal in employees.Salary:
        return employees.groupby('Department')['Salary'].max() - employees.groupby('Department')['Salary'].min()

In [52]:
diff_salary()

Department
HR       40
IT       40
Sales     0
Name: Salary, dtype: int64

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [53]:
data = pd.read_csv('C:/Users/user/Documents/02 - FORMATION/Iron Hack - Data Analysis/Module 2/Orders/orders.csv')
orders = pd.DataFrame(data)
orders

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397919,541904,581587,22613,2011,12,5,12,pack of 20 spaceboy napkins,12,2011-12-09 12:50:00,0.85,12680,France,10.20
397920,541905,581587,22899,2011,12,5,12,children's apron dolly girl,6,2011-12-09 12:50:00,2.10,12680,France,12.60
397921,541906,581587,23254,2011,12,5,12,childrens cutlery dolly girl,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397922,541907,581587,23255,2011,12,5,12,childrens cutlery circus parade,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397923,541908,581587,22138,2011,12,5,12,baking set 9 piece retrospot,3,2011-12-09 12:50:00,4.95,12680,France,14.85

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [54]:
orders.dtypes

Unnamed: 0        int64
InvoiceNo         int64
StockCode        object
year              int64
month             int64
day               int64
hour              int64
Description      object
Quantity          int64
InvoiceDate      object
UnitPrice       float64
CustomerID        int64
Country          object
amount_spent    float64
dtype: object

In [55]:
orders.describe()

,Unnamed: 0,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,CustomerID,amount_spent
count,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000
mean,278465.221859,560617.126645,2010.934259,7.612537,3.614555,12.728247,13.021823,3.116174,15294.315171,22.394749
std,152771.368303,13106.167695,0.247829,3.416527,1.928274,2.273535,180.420210,22.096788,1713.169877,309.055588
min,0.000000,536365.000000,2010.000000,1.000000,1.000000,6.000000,1.000000,0.000000,12346.000000,0.000000
25%,148333.750000,549234.000000,2011.000000,5.000000,2.000000,11.000000,2.000000,1.250000,13969.000000,4.680000
50%,284907.500000,561893.000000,2011.000000,8.000000,3.000000,13.000000,6.000000,1.950000,15159.000000,11.800000
75%,410079.250000,572090.000000,2011.000000,11.000000,5.000000,14.000000,12.000000,3.750000,16795.000000,19.800000
max,541908.000000,581587.000000,2011.000000,12.000000,7.000000,20.000000,80995.000000,8142.750000,18287.000000,168469.600000

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [56]:
orders['amount_spent'].mean()

22.39474850474768

#### What are the highest and lowest purchase prices?

In [57]:
orders['amount_spent'].max()

168469.6

In [58]:
orders['amount_spent'].min()

0.0

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [59]:
set(orders[orders.Country == 'Spain']['CustomerID'])

{12354,
 12417,
 12421,
 12442,
 12445,
 12448,
 12450,
 12454,
 12455,
 12462,
 12484,
 12502,
 12507,
 12510,
 12538,
 12539,
 12540,
 12541,
 12544,
 12545,
 12546,
 12547,
 12548,
 12550,
 12551,
 12556,
 12557,
 12596,
 12597,
 17097}

#### How many customers do we have in Spain?

In [60]:
len(set(orders[orders.Country == 'Spain']['CustomerID']))

30

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [80]:
#revoir
orders

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397919,541904,581587,22613,2011,12,5,12,pack of 20 spaceboy napkins,12,2011-12-09 12:50:00,0.85,12680,France,10.20
397920,541905,581587,22899,2011,12,5,12,children's apron dolly girl,6,2011-12-09 12:50:00,2.10,12680,France,12.60
397921,541906,581587,23254,2011,12,5,12,childrens cutlery dolly girl,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397922,541907,581587,23255,2011,12,5,12,childrens cutlery circus parade,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397923,541908,581587,22138,2011,12,5,12,baking set 9 piece retrospot,3,2011-12-09 12:50:00,4.95,12680,France,14.85

In [59]:
#orders[orders.Qty_sum > 50]['CustomerID']

#### Select orders from Spain that include more than 50 items.

In [ ]:
#orders(orders.Qty_sum > 50) & (orders.Country == 'Spain')['CustomerID']

#### Select all free orders.

In [84]:
orders[orders.amount_spent == 0]['InvoiceNo']

6914      537197
22539     539263
25379     539722
29080     540372
29082     540372
34494     541109
53788     543599
85671     547417
92875     548318
97430     548871
107192    550188
128641    553000
137127    554037
194648    561284
197173    561669
199711    561916
208950    562973
223931    564651
223932    564651
223933    564651
223934    564651
256263    568158
259399    568384
273926    569716
286507    571035
307092    572893
319882    574138
320049    574175
320407    574252
322279    574469
328385    574879
329006    574920
329007    574920
334242    575579
334243    575579
352746    577129
353097    577168
354170    577314
358629    577696
370473    578841
Name: InvoiceNo, dtype: int64

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [85]:
orders[orders.Description.str.startswith('lunch bag')]['InvoiceNo']

93        536378
172       536385
354       536401
359       536401
360       536401
           ...
397465    581486
397713    581538
397714    581538
397877    581581
397880    581583
Name: InvoiceNo, Length: 11556, dtype: int64

#### Select all `lunch bag` orders made in 2011.

In [89]:
orders(orders.Description.str.startswith('lunch bag')) & (orders.year == '2011')['InvoiceNo']

TypeError: 'DataFrame' object is not callable

#### Show the frequency distribution of the amount spent in Spain.

In [76]:
#revoir
orders(orders.Country == 'Spain')['amount_spent']

TypeError: 'DataFrame' object is not callable

#### Select all orders made in the month of August.

In [80]:
#revoir
orders(orders.month == '08')['InvoiceNo']

TypeError: 'DataFrame' object is not callable

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [88]:
orders.groupby('Country')['Quantity'].value_counts() 
#[orders.month == '08']

Country      Quantity
Australia    12          119
             24           82
             96           80
             6            78
             48           69
                        ...
Unspecified  16            3
             18            3
             5             2
             36            2
             8             1
Name: Quantity, Length: 1185, dtype: int64

#### What's the  average amount of money spent by country?

In [92]:
orders.groupby('Country')['amount_spent'].mean()

Country
Australia               116.895620
Austria                  25.624824
Bahrain                  32.258824
Belgium                  20.283772
Brazil                   35.737500
Canada                   24.280662
Channel Islands          27.340160
Cyprus                   22.134169
Czech Republic           33.069600
Denmark                  49.882474
EIRE                     36.687745
European Community       21.670833
Finland                  32.913985
France                   25.056827
Germany                  25.311562
Greece                   32.831172
Iceland                  23.681319
Israel                   29.119718
Italy                    23.064960
Japan                   116.561900
Lebanon                  37.641778
Lithuania                47.458857
Malta                    24.335625
Netherlands             120.798282
Norway                   33.736418
Poland                   22.226212
Portugal                 22.872702
RSA                      17.281207
Saudi Arabia             16.213333
Singapore                95.852658
Spain                    24.779521
Sweden                   85.096075
Switzerland              30.642752
USA                      20.002179
United Arab Emirates     27.974706
United Kingdom           20.625073
Unspecified              10.930615
Name: amount_spent, dtype: float64

#### What's the most expensive item?

In [98]:
orders['UnitPrice'].max()
#['Description']

8142.75

#### What is the average amount spent per year?

In [99]:
orders.groupby('year')['amount_spent'].mean()

year
2010    21.892733
2011    22.430074
Name: amount_spent, dtype: float64